[
    {
        "id": 1,
        "title": "Sales Representative",
        "image": "images/blog/person.jpg",
        "text": "Experience",
        "largeImage": "images/blog/person.jpg",
        "author": ["Experienced"],
        "date": "Jan 29, 2024",
        "view": "70 views",
        "categories": ["Sales", "Marketing"],
        "excerpt": "We have always known the power of digital we've.",
        "body":  ["<p><h2>Experienced Sales Representative</h2></br><strong>Location:</strong> Remote</br><strong>Job Type:</strong> Full Time</br></br><h4>Job Description:</h4>We are seeking a motivated and experienced sales representative with a proven track record in freight brokerage. The ideal candidate will have extensive knowledge of the freight and transportation industry, strong negotiation skills, and the ability to build and maintain relationships with both new and existing clients.</br></br><h4>Key Responsibilities:</h4> <ul><li>Develop and maintain a strong pipeline of new business through cold calling, networking, and referrals.</li><li>Negotiate rates and contracts with customers and carriers.</li></li>Understand and effectively communicate market trends and freight solutions.</li><li>Provide exceptional customer service and support, ensuring clients’ needs are met and exceeded.</li><li>Collaborate with the operations team to ensure smooth and efficient freight deliveries.</li><li>Keep up-to-date with industry developments and changes in regulations.</li><li>Meet and exceed sales targets.</li></ul><h4>Qualifications:</h4> <ul><li>Minimum of 2 years of sales experience in freight brokerage.</li><li>Strong understanding of the transportation and logistics industry.</li></li>Excellent communication and negotiation skills.</li><li>Ability to work independently and in a team environment.</li><li>Proven track record of meeting or exceeding sales targets.</li><li>Experience with CRM software and freight brokerage platforms.</li><li>High school diploma required; bachelor’s degree in business, logistics, or related field preferred.</li></ul><h4>What We Offer:</h4> <ul><li>Competitive salary plus commissions.</li><li>Health, dental, and vision insurance.</li></li>All necessary tools for success.</li><li>A supportive and dynamic team environment.</li></ul></p>"],
        "tags": ["Corporate", "Agency", "Creative", "Design"]
    }
]